{"columns": ["​", "​", "​", "​", "​", "​", "​", "​", "​", "​", "​", "​", "​", "​", "​", "​", "​", "​"], "(dollars and shares": [], "": ["315.2", "​", "​"], "in millions, except per share data)": ["​", "2020", "​", "2019", "​", "2018", "​", "2017", "​", "2016"], "Operations": ["​", "​", "​", "​", "​", "​", "​", "​", "​", "​", "​", "​", "​", "​", "​", "​", "​"], "Net sales": ["​", "8,598.9", "​", "8,225.4", "​", "8,202.0", "​", "7,011.3", "​", "6,286.4", "​", "​"], "Net income attributable to Amphenol Corporation": ["​"], "Financial Condition": ["​", "​", "​", "​", "​", "​", "​", "​", "​", "​", "​", "​", "​", "​", "​", "​", "​"], "Cash, cash equivalents and short-term investments": ["​", "1,738.1", "​", "908.6", "​", "1,291.7", "​", "1,753.7", "​", "1,173.2", "​", "​"], "Working capital": ["​"], "Total assets": ["​"], "Long-term debt, including current portion": ["​"], "Cash dividends declared per share": ["​", "1.04", "​", "0.96", "​", "0.88", "​", "0.70", "​", "0.58", "​", "​", "(1)", "Includes (a) excess tax benefits related to stock-based compensation of $42.8 resulting from stock option exercises and (b) a discrete tax benefit of $19.9 related to the settlements of refund claims in certain non-U.S. jurisdictions and the resulting adjustments to deferred taxes, partially offset by (c) acquisition-related expenses of $11.5 ($10.7 after-tax) primarily comprised of external transaction costs related to acquisitions that were announced or closed.  These items had the aggregate effect of increasing Net income attributable to Amphenol Corporation and Net income per common share-Diluted by $52.0 and $0.17 per share, respectively.  Excluding the effect of these items, Adjusted Net Income attributable to Amphenol Corporation and Adjusted Diluted EPS, both non-GAAP financial measures defined in Part II, Item 7 herein, were $1,151.4 and $3.74 per share, respectively, for the year ended December 31, 2020.", "(2)", "Includes (a) excess tax benefits related to stock-based compensation of $38.1 resulting from stock option exercises, partially offset by (b) acquisition-related expenses of $25.4 ($21.0 after-tax) comprised of the amortization related to the value associated with acquired backlog from two acquisitions, along with external transaction costs and (c) refinancing-related costs of $14.3 ($12.5 after-tax) associated with the early extinguishment of debt.  These items had the aggregate effect of increasing Net income attributable to Amphenol Corporation and Net income per common share-Diluted by $4.6 and $0.01 per share, respectively.  Excluding the effect of these items, Adjusted Net Income attributable to Amphenol Corporation and Adjusted Diluted EPS, both non-GAAP financial measures defined in Part II, Item 7 herein, were $1,150.4 and $3.74 per share, respectively, for the year ended December 31, 2019.", "(3)", "Includes (a) an income tax benefit of $14.5 recorded in 2018 related to the completion of the accounting associated with the provisional income tax charge recorded in 2017 related to the enactment of the Tax Cuts and Jobs Act and (b) excess tax benefits related to stock-based compensation of $19.8 resulting from stock option exercises, partially offset by (c) acquisition-related expenses of $8.5 ($7.2 after-tax) primarily relating to external transaction costs.  These items had the aggregate effect of increasing Net income attributable to Amphenol Corporation and Net income per common share-Diluted by $27.1 and $0.08 per share, respectively.  Excluding the effect of these items, Adjusted Net Income attributable to Amphenol Corporation and Adjusted Diluted EPS were $1,177.9 and $3.77 per share, respectively, for the year ended December 31, 2018.", "(4)", "Includes (a) an income tax charge of $398.5 related to the enactment of the Tax Cuts and Jobs Act, which represented our estimate of taxes arising from the implementation of a modified territorial tax regime and the deemed and intended repatriation of prior unremitted earnings of foreign subsidiaries, partially offset by the tax benefit associated with the remeasurement of the Company’s U.S. net deferred tax liabilities due to the U.S. federal corporate tax rate reduction and (b) acquisition-related expenses of $4.0 ($3.7 after-tax) primarily relating to external transaction costs associated with 2017 acquisitions, partially offset by (c) excess tax benefits related to stock-based compensation of $66.6 resulting from stock option exercises.  These items had the aggregate effect of decreasing Net income attributable to Amphenol Corporation and Net income per common share-Diluted by $335.6 and $1.06 per share, respectively.  Excluding the effect of these items, Adjusted Net Income attributable to Amphenol Corporation and Adjusted Diluted EPS were $986.1 and $3.12 per share, respectively, for the year ended December 31, 2017.", "(5)", "Includes acquisition-related expenses of $36.6 ($33.1 after-tax) primarily relating to the FCI Asia Pte. Ltd. (“FCI”) and other 2016 acquisitions, including external transaction costs, amortization related to the value associated with acquired backlog and restructuring charges.  These items had the aggregate effect of decreasing Net income attributable to Amphenol Corporation and Net income per common share-Diluted by $33.1 and $0.11 per share, respectively.  Excluding the effect of these items, Adjusted Net Income attributable to Amphenol Corporation and Adjusted Diluted EPS were $856.0 and $2.72 per share, respectively, for the year ended December 31, 2016."]}