{"columns": [], "": [], "Commercial remaining performance obligation": [], "Commercial portion of revenue allocated to remaining performance obligations, which includes unearned revenue and amounts that will be invoiced and recognized as revenue in future periods": [], "Commercial cloud revenue": [], "Commercial cloud gross margin percentage": [], "Gross margin percentage for our commercial cloud business": [], "Office Commercial products and cloud services revenue growth": [], "Office Consumer products and cloud services revenue growth": [], "Dynamics products and cloud services revenue growth": [], "LinkedIn revenue growth": [], "Revenue from LinkedIn, including Talent Solutions, Marketing Solutions, Premium Subscriptions, Sales Solutions, and Learning Solutions": [], "Server products and cloud services revenue growth": [], "Windows OEM Pro revenue growth": [], "Revenue from sales of Windows Pro licenses sold through the OEM channel, which primarily addresses demand in the commercial market": [], "Windows OEM non-Pro revenue growth": [], "Revenue from sales of Windows non-Pro licenses sold through the OEM channel, which primarily addresses demand in the consumer market": [], "Windows Commercial products and cloud services revenue growth": [], "Revenue from Windows Commercial products and cloud services, comprising volume licensing of the Windows operating system, Windows cloud services, and other Windows commercial offerings": [], "Surface revenue": [], "Revenue from Surface devices and accessories": [], "Xbox content and services revenue growth": [], "Revenue from Xbox content and services, comprising digital transactions, Xbox Game Pass and other subscriptions, video games, third-party video game royalties, cloud services, and advertising": [], "Search advertising revenue, excluding TAC, growth": [], "(In millions, except percentages and per share amounts)": [], "PercentageChange": [], "Revenue": [], "Gross margin": [], "Operating income": [], "Net income": [], "Diluted earnings per share": [], "Adjusted net income (non-GAAP)": [], "Adjusted diluted earnings per share (non-GAAP)": [], "General and administrative expenses were relatively unchanged, driven by prior year charges associated with the closing of our Microsoft Store physical locations, offset in part by an increase in certain employee-related expenses and business taxes.": [], "(In millions, except percentages)": [], "Productivity and Business Processes": [], "Intelligent Cloud": [], "More Personal Computing": [], "Total": [], "Operating Income": [], "Research and development": [], "As a percent of revenue": [], "Sales and marketing": [], "General and administrative": [], "(In millions)": [], "Interest and dividends income": [], "Interest expense": [], ")": [], "Net recognized gains on investments": [], "Net gains on derivatives": [], "Net gains (losses) on foreign currency remeasurements": [], "Other, net": [], "(In millions, except percentages and per share amounts)": [], "Net income tax benefit related to India Supreme Court decision on withholding taxes": [], "Not meaningful.": [], "Three Months Ending": [], "Thereafter": [], "Long-term debt: (a)": [], "Principal payments": [], "Interest payments": [], "Construction commitments (b)": [], "Operating leases, including imputed interest (c)": [], "Finance leases, including imputed interest (c)": [], "Transition tax (d)": [], "Purchase commitments (e)": [], "Other long-term liabilities (f)": [], "(a)": ["Refer to Note 11 – Debt of the Notes to Financial Statements (Part II, Item 8 of this Form 10-K)."], "(b)": ["Refer to Note 7 – Property and Equipment of the Notes to Financial Statements (Part II, Item 8 of this Form 10-K)."], "(c)": ["Refer to Note 14 – Leases of the Notes to Financial Statements (Part II, Item 8 of this Form 10-K)."], "(d)": ["Refer to Note 12 – Income Taxes of the Notes to Financial Statements (Part II, Item 8 of this Form 10-K)."], "(e)": [], "Amounts represent purchase commitments, including open purchase orders and take-or-pay contracts that are not presented as construction commitments above.": [], "(f)": ["We have excluded long-term tax contingencies, other tax liabilities, and deferred income taxes of $14.6 billion from the amounts presented as the timing of these obligations is uncertain. We have also excluded unearned revenue and non-cash items."]}